clc;
clear
%% 整车参数
m=1412; %整车质量kg
mb=1270; %车身质量kg


mw=(m-mb)/4; %轮胎重力kg
Bf=1.675; %前轴轮距m 
Br=1.675; %后轴轮距m
Lf=1.015; %质心距离前轴的距离m
Lr=1.895; %质心距离后轴的距离m
L=Lf+Lr; %轴距m 
hg=0.54; %质心距离地面高度m
Ix= 536.6; %整车x轴转动惯量kg*m^2
Iy=1536.7; %整车y轴转动惯量kg*m^2
Iz=1536.7 ; %整车z轴转动惯量kg*m^2
I_tire=0.9; %轮胎转动惯量/ kg*m^2
ks_f=27000; %前悬架垂直刚度N/m
ks_r=30000; %后悬架垂直刚度N/m
Cs_f=1730; %前悬架阻尼 N/(m/s)
Cs_r=1730; %后悬架阻尼 N/(m/s)
kw=268000; %轮胎垂直刚度N/m

He=0.45; %车身质心至侧倾轴线的高度 m
Hp=0.2; %车身质心至俯仰中心的高度 m
f=0.015; %滚动阻力系数
r=0.325; %车轮滚动半径/ m
u=1; %路面附着系数
g=9.8; %重力加速度
Cd=0.3; %空气阻力系数
A=2.2; %迎风面积m^2
p=1.206; %空气密度 N*s^2/m^4
Pn_motor=120; %电机额定功率 Kw
Tn_motor=1000; %电机额定扭矩 N*m

vx0=90/3.6; %初始Vx速度 m/s
w0=vx0/r; %初始轮速 rad/s
v_obj=100/3.6; %期望车速 m/s





