clc;
clear
%% 整车参数
m=1765; %整车质量kg
mb=1600; %车身质量kg


mw=(m-mb)/4; %轮胎重力kg
Bf=1.55; %前轴轮距m 
Br=1.55; %后轴轮距m
Lf=1.27; %质心距离前轴的距离m
Lr=1.4; %质心距离后轴的距离m
Ix=894; %整车x轴转动惯量kg*m^2
Iy=2700; %整车y轴转动惯量kg*m^2
Iz=2700; %整车z轴转动惯量kg*m^2
I_tire=2.5; %轮胎转动惯量/ kg*m^2
ks_f=20000; %前悬架垂直刚度N/m
ks_r=20000; %后悬架垂直刚度N/m
Cs_f=1200; %前悬架阻尼 N/(m/s)
Cs_r=1200; %后悬架阻尼 N/(m/s)
kw=265348; %轮胎垂直刚度N/m

He=0.5; %车身质心至侧倾轴线的高度 m
Hp=0.2; %车身质心至俯仰中心的高度 m
f=0.015; %滚动阻力系数
r=0.357; %车轮滚动半径/ m
u=0.8; %路面附着系数
i_sw=50; %转向系传动比
g=10; %重力加速度
Cd=0.3; %空气阻力系数
A=2; %迎风面积m^2
p=1.2258; %空气密度 N*s^2/m^4
Pn_motor=80; %电机额定功率 Kw
Tn_motor=1000; %电机额定扭矩 N*m

vx0=20; %初始Vx速度 m/s
w0=vx0/r; %初始轮速 rad/s
v_obj=20; %期望车速 m/s





